Foundation/v12/test/system/controlDict
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  12
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    format      ascii;
    class       dictionary;
    location    "system";
    object      controlDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

application     foamRun;

solver          shockFluid;

startFrom       latestTime;

startTime       0;

stopAt          endTime; //pswriteNow;

endTime         0.02;

deltaT          6e-8;

writeControl    adjustableRunTime;

writeInterval   1e-3;

cycleWrite      0;

writeFormat     binary;

writePrecision  8;

writeCompression off;

timeFormat      general;

timePrecision   6;

runTimeModifiable true;

adjustTimeStep  yes;
// adjustTimeStep  yes;

maxCo           0.5;

maxDeltaT       1e-5;

//#include "$FOAM_CASE/system/functions/functions"

// ************************************************************************* //
