Foundation/v12/test/system/gradU
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  12
     \\/     M anipulation  |
-------------------------------------------------------------------------------
Description
    Calculates the gradient of a field.

\*---------------------------------------------------------------------------*/

type            grad;
libs            ("libfieldFunctionObjects.so");

field           U;
result          gradU

executeControl  timeStep;
executeInterval 1;
writeControl    writeTime;
//writeInterval   ;

// ************************************************************************* //
