Foundation/v12/test/system/magGradU
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  12
     \\/     M anipulation  |
-------------------------------------------------------------------------------
Description
    Calculates the magnitude of a field.

\*---------------------------------------------------------------------------*/

type            mag;
libs            ("libfieldFunctionObjects.so");

field           gradU;
result          magGradU;

executeControl  timeStep;
executeInterval 1;
writeControl    writeTime;

// ************************************************************************* //
