Foundation/v12/test/system/multiply
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  12
     \\/     M anipulation  |
-------------------------------------------------------------------------------
Description
    Multiply a list of fields.

\*---------------------------------------------------------------------------*/

type            multiply;
libs            ("libfieldFunctionObjects.so");

fields          (rho U);
result          refineField;

executeControl  timeStep;
executeInterval 1;
writeControl    writeTime;

// ************************************************************************* //
